# 2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв
# метра дороги асфальтом, толщиной в 1 см * чи сло см толщины полотна.
# Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т


class Road:
    """
    Атрибуты:
    Длина : int
    Ширина : int
    """

    def __init__(self, length, width):
        self.__length = length
        self.__width = width

    def mass(self):
        """Метод расчета массы асфальта"""
        weight = 25
        mass_cm = 0.05
        mass = self.__length * self.__width * weight * mass_cm / 10
        print(mass)


road_way = Road(5000, 20)
road_way.mass()
